# FilterStringEquals Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringEquals Class
Members See Also
---
Tests whether string values from the document match a certain string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterStringEquals : FilterStringRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterStringEquals _
	Inherits FilterStringRuleEvaluator
```

Visual C++
---
```text
public ref class FilterStringEquals : public FilterStringRuleEvaluator
```

# Remarks
All string comparisons in this class are performed in the case-insensitive manner.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterStringRuleEvaluator Autodesk.Revit.DB..::..FilterStringEquals
# See Also
FilterStringEquals Members
Autodesk.Revit.DB Namespace